tap "brewforge/extras"
tap "dart-lang/dart"
tap "leoafarias/fvm"
tap "powershell/tap"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Distributed revision control system
brew "git"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@11"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Additional completion definitions for zsh
brew "zsh-completions"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# Formula to install PowerShell
brew "powershell/tap/powershell"
# Desktop password and login vault
cask "bitwarden"
# Anthropic's official Claude AI desktop app
cask "claude"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Write, edit, and chat about your code with AI
cask "cursor"
# Window peeking utility app
cask "dockdoor"
# Online diagram software
cask "drawio"
cask "font-caskaydia-cove-nerd-font"
# GIT client
cask "fork"
# Menu bar manager
cask "jordanbaird-ice@beta"
# Ultimate Lyrics App
cask "lyricsx-mxiris"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open source build of Lens Kubernetes IDE
cask "openlens"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# GUI for streamlined Redis application development
cask "redis-insight"
# Collection of apps available by subscription
cask "setapp"
# Screenshot measurement and annotation tool
cask "shottr"
# Communicate and share information between devices
cask "soduto"
# Music streaming service
cask "spotify"
# Unpacks archive files
cask "the-unarchiver"
# Rust-based terminal
cask "warp"
# OpenJDK distribution from Azul
cask "zulu"
# OpenJDK distribution from Azul
cask "zulu@17"
# OpenJDK distribution from Azul
cask "zulu@8"
vscode "angular.ng-template"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "cwan.native-ascii-converter"
vscode "cyrilletuzi.angular-schematics"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "diemasmichiels.emulate"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "google.geminicodeassist"
vscode "grapecity.gc-excelviewer"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "johnpapa.angular2"
vscode "mateocerquetella.xcode-12-theme"
vscode "mongodb.mongodb-vscode"
vscode "ms-ceintl.vscode-language-pack-zh-hant"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vsliveshare.vsliveshare"
vscode "mylesmurphy.prettify-ts"
vscode "naco-siren.gradle-language"
vscode "ni.azdo-wiki-md"
vscode "nrwl.angular-console"
vscode "nuxt.mdc"
vscode "nuxtr.nuxt-vscode-extentions"
vscode "nuxtr.nuxtr-vscode"
vscode "piyushvscode.nodejs-snippets"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "richardwillis.vscode-gradle-extension-pack"
vscode "ritwickdey.liveserver"
vscode "runarsf.platform-settings"
vscode "rvest.vs-code-prettier-eslint"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vue.volar"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
