tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "leoafarias/fvm"
tap "powershell/tap"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Distributed revision control system
brew "git"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@11"
# Additional completion definitions for zsh
brew "zsh-completions"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# Formula to install PowerShell
brew "powershell/tap/powershell"
# Chromium based browser
cask "arc"
# App to build and share containerised applications and microservices
cask "docker"
# Online diagram software
cask "drawio"
cask "font-caskaydia-cove-nerd-font"
# GIT client
cask "fork"
# Utility to hide menu bar items
cask "hiddenbar"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open source build of Lens Kubernetes IDE
cask "openlens"
# Search utility for icons8
cask "pichon"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# GUI for streamlined Redis application development
cask "redisinsight"
# Screenshot measurement and annotation tool
cask "shottr"
# Communicate and share information between devices
cask "soduto"
# Unpacks archive files
cask "the-unarchiver"
# OpenJDK distribution from Azul
cask "zulu@17"
# OpenJDK distribution from Azul
cask "zulu@8"
