tap "dart-lang/dart"
tap "leoafarias/fvm"
tap "powershell/tap"
tap "theboredteam/boring-notch"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Distributed revision control system
brew "git"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@11"
# Command-line shell and scripting language
brew "powershell"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Additional completion definitions for zsh
brew "zsh-completions"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# Desktop password and login vault
cask "bitwarden"
# Not so boring notch That Rocks 🎸🎶 
cask "theboredteam/boring-notch/boring-notch"
# Anthropic's official Claude AI desktop app
cask "claude"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Write, edit, and chat about your code with AI
cask "cursor"
# Window peeking utility app
cask "dockdoor"
# Online diagram software
cask "drawio"
cask "font-caskaydia-cove-nerd-font"
# GIT client
cask "fork"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open source build of Lens Kubernetes IDE
cask "openlens"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# GUI for streamlined Redis application development
cask "redis-insight"
# Collection of apps available by subscription
cask "setapp"
# Communicate and share information between devices
cask "soduto"
# Music streaming service
cask "spotify"
# Menu bar manager
cask "thaw"
# Unpacks archive files
cask "the-unarchiver"
# Rust-based terminal
cask "warp"
# OpenJDK distribution from Azul
cask "zulu"
# OpenJDK distribution from Azul
cask "zulu@17"
# OpenJDK distribution from Azul
cask "zulu@8"
